Кинотеатр/src/Catalogs/Сеансы/Сеансы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сеансы</name>
  <attributes>
    <name>Фильм</name>
    <type>
      <types>CatalogRef.Фильмы</types>
    </type>
  </attributes>
  <attributes>
    <name>Кинозал</name>
    <type>
      <types>CatalogRef.Кинозалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

Кинотеатр/src/Catalogs/Сеансы/Forms/ФормаЭлемента/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КинозалПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Фильм) Тогда

		ВремяФильма = ДлительностьФильма(Объект.Фильм);
		
		Если Не ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
			
			//@skip-check use-non-recommended-method
			Объект.ДатаНачала = НачалоДня(ТекущаяДата()) + 3600 * 12;
			
		КонецЕсли;
		
		Объект.ДатаОкончания = Объект.ДатаНачала + ВремяФильма * 60;

	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ДлительностьФильма(Фильм)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Фильмы.Длительность КАК Длительность
		|ИЗ
		|	Справочник.Фильмы КАК Фильмы
		|ГДЕ
		|	Фильмы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Фильм);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Длительность;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

#КонецОбласти
